app/controllers/companies_controller.rb

  def fill_cities_name
    state = params[:state]
    if state
      @cities = City.where(state: state)
---
SELECT "cities".* FROM "cities"  WHERE "cities"."state" = 'SP'

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("cnpj", "created_at", "name", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cnpj", "3"], ["created_at", "2014-10-17 19:31:52.381223"], ["name", "T3"], ["state", "SP"], ["updated_at", "2014-10-17 19:31:52.381223"]]

    def set_company
      @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]